"""update_exams

Revision ID: 553c3d5b819d
Revises: ff3f0a4a1f45
Create Date: 2025-04-04 11:51:42.746150

"""
from typing import Sequence, Union

from alembic import op
import sqlalchemy as sa


# revision identifiers, used by Alembic.
revision: str = '553c3d5b819d'
down_revision: Union[str, None] = 'ff3f0a4a1f45'
branch_labels: Union[str, Sequence[str], None] = None
depends_on: Union[str, Sequence[str], None] = None


def upgrade() -> None:
    
    #исправляем опечатку
    op.execute("""
    UPDATE discipline
    SET title_discipline = 'Английский'
    WHERE n_discipline = 3;
    """)

    #добавляем однофамильцев Иванова 
    op.execute("""
    SELECT setval('public.student_n_credit_book_seq', (SELECT MAX(n_credit_book) FROM student));          

    INSERT INTO student (second_name, name, patronymic, n_group, telephone)
    VALUES  ('Иванов', 'Максим', 'Игоревич', '14A', '89771114233'),
            ('Иванов', 'Игорь', 'Сергеевич', '15D', NULL);
    """)

    op.execute("COMMIT;")

    #очищаем таблицу с оценками за экзамен
    op.execute("""
    DELETE FROM student_discipline;
    """)

    #добавляем оценки
    op.execute("""
    INSERT INTO student_discipline (n_credit_book, n_discipline, estimation)
    VALUES  (1, 1, 5),
            (1, 2, 5),
            (1, 3, 3),
            (2, 1, 3),
            (2, 2, 2),
            (2, 3, 4),
            (3, 1, 5),
            (3, 2, 5),
            (3, 3, 5),
            (4, 1, 4),
            (4, 2, 4),
            (4, 3, 4),
            (5, 1, 2),
            (5, 2, 2),
            (5, 3, 2),
            (6, 1, 4),
            (6, 2, 3),
            (6, 3, 4),
            (7, 1, 2),
            (7, 2, 5),
            (7, 3, 4),
            (8, 1, 5),
            (8, 2, 3),
            (8, 3, 2),
            (9, 1, 3),
            (9, 2, 3),
            (9, 3, 4),
            (10, 1, 4),
            (10, 2, 3),
            (10, 3, 5),
            (11, 1, 3),
            (11, 2, 3),
            (11, 3, 3),
            (12, 1, 2),
            (12, 2, 2),
            (12, 3, 2),
            (13, 1, 4),
            (13, 2, 5),
            (13, 3, 4),
            (14, 6, 5),
            (14, 7, 4),
            (14, 9, 3),
            (14, 10, 4),
            (15, 6, 5),
            (15, 7, 5),
            (15, 9, 5),
            (15, 10, 5),
            (16, 6, 4),
            (16, 7, 3),
            (16, 9, 3),
            (16, 10, 2),
            (17, 6, 3),
            (17, 7, 3),
            (17, 9, 3),
            (17, 10, 3),
            (18, 6, 2),
            (18, 7, 3),
            (18, 9, 2),
            (18, 10, 3),
            (19, 6, 4),
            (19, 7, 4),
            (19, 9, 5),
            (19, 10, 3),
            (20, 14, 4),
            (20, 15, 4),
            (20, 16, 5),
            (21, 14, 4),
            (21, 15, 4),
            (21, 16, 5),
            (22, 14, 4),
            (22, 15, 4),
            (22, 16, 5),
            (23, 14, 4),
            (23, 15, 4),
            (23, 16, 5),
            (24, 14, 4),
            (24, 15, 4),
            (24, 16, 5),
            (25, 14, 4),
            (25, 15, 4),
            (25, 16, 5),
            (26, 11, 4),
            (26, 12, 4),
            (26, 13, 5),
            (27, 11, 4),
            (27, 12, 4),
            (27, 13, 5),
            (28, 11, 4),
            (28, 12, 4),
            (28, 13, 5),
            (29, 11, 4),
            (29, 12, 4),
            (29, 13, 5), 
            (30, 11, 4),
            (30, 12, 4),
            (30, 13, 5),  
            (31, 1, 5),
            (31, 2, 3),
            (31, 3, 4),
            (32, 1, 2),
            (32, 2, 2),
            (32, 3, 5);         
    """) 
    op.execute("COMMIT;") 
    pass

def downgrade() -> None:

    op.execute("""
    UPDATE discipline
    SET title_discipline = 'Английский язык'
    WHERE n_discipline = 3;
    """)

    op.execute("""
    DELETE FROM student
    WHERE n_credit_book > 30;
    """)

    op.execute("""
    DELETE FROM student_discipline;
    """)

    op.execute("""
    INSERT INTO student_discipline (n_credit_book, n_discipline, estimation)
    VALUES  (1, 1, 5),
            (1, 2, 4),
            (2, 1, 3),
            (2, 3, 2),
            (3, 2, 5),
            (4, 3, 4),
            (5, 2, 4),
            (5, 3, 2),
            (5, 10, 2),
            (6, 4, 5),
            (6, 6, 2),
            (6, 7, 4),
            (7, 1, 2),
            (7, 2, 5),
            (7, 4, 4),
            (8, 3, 2),
            (8, 5, 5),
            (8, 6, 4),
            (9, 2, 4),
            (9, 7, 3),
            (9, 10, 5),
            (10, 4, 4),
            (10, 6, 3),
            (10, 7, 5),
            (10, 13, 5),
            (10, 14, 5),
            (10, 15, 5),
            (11, 1, 4),
            (11, 5, 3),
            (11, 6, 5),
            (11, 10, 5),
            (11, 11, 5),
            (11, 12, 5),
            (12, 1, 2),
            (12, 2, 3),
            (12, 3, 2),
            (12, 4, 5),
            (12, 7, 4),
            (12, 10, 2),
            (13, 3, 4),
            (13, 6, 5),
            (13, 7, 4),
            (14, 1, 5),
            (14, 2, 4),
            (14, 3, 2),
            (15, 5, 5),
            (15, 6, 2),
            (15, 7, 5),
            (16, 1, 3),
            (16, 2, 4),
            (16, 4, 4),
            (17, 3, 2),
            (17, 5, 4),
            (17, 6, 5),
            (18, 4, 5),
            (18, 6, 3),
            (18, 7, 5),
            (19, 1, 4),
            (19, 2, 5),
            (19, 6, 4),
            (20, 3, 5),
            (20, 5, 4),
            (20, 7, 3),
            (21, 4, 4),
            (21, 6, 5),
            (21, 7, 2),
            (22, 1, 5),
            (22, 2, 4),
            (22, 5, 4),
            (23, 6, 5),
            (23, 7, 5),
            (23, 8, 3),
            (24, 3, 5),
            (24, 6, 3),
            (24, 10, 4),
            (25, 2, 4),
            (25, 5, 5),
            (25, 7, 4),
            (26, 2, 5),
            (26, 6, 4),
            (26, 10, 5),
            (27, 3, 5),
            (27, 5, 3),
            (27, 6, 4),
            (28, 4, 5),
            (28, 7, 3),
            (28, 9, 2),
            (29, 1, 4),
            (29, 2, 5),
            (29, 6, 5),
            (30, 3, 4),
            (30, 5, 4),
            (30, 7, 5);
    """)
    op.execute("COMMIT;") 
    pass
