"""improved_data

Revision ID: 5d4ea56c71d7
Revises: 04ec75b3dc74
Create Date: 2025-02-23 14:26:03.093933

"""
from typing import Sequence, Union

from alembic import op
import sqlalchemy as sa


# revision identifiers, used by Alembic.
revision: str = '5d4ea56c71d7'
down_revision: Union[str, None] = '04ec75b3dc74'
branch_labels: Union[str, Sequence[str], None] = None
depends_on: Union[str, Sequence[str], None] = None


def upgrade() -> None:

    # вставляем 17 новых студентов (теперь их будет 30)
    op.execute("""
    SELECT setval('public.student_n_credit_book_seq', (SELECT MAX(n_credit_book) FROM student) + 1);

    INSERT INTO student (second_name, name, patronymic, n_group, telephone)
    VALUES  ('Борисов', 'Максим', 'Игоревич', '23C', '89771112233'),
            ('Миронова', 'Екатерина', 'Сергеевна', '23C', NULL),
            ('Гаврилов', 'Артём', 'Васильевич', '23C', '89882223344'),
            ('Денисова', 'Юлия', 'Викторовна', '24A', NULL),
            ('Жуков', 'Павел', 'Алексеевич', '24A', '89993334455'),
            ('Захарова', 'Алина', 'Дмитриевна', '24A', '89115556677'),
            ('Игнатьев', 'Сергей', 'Романович', '32B', NULL),
            ('Миронов', 'Марина', 'Евгеньевна', '32B', '89227778899'),
            ('Лазарев', 'Олег', 'Станиславович', '32B', NULL),
            ('Макарова', 'Татьяна', 'Артёмовна', '33C', '89338889900'),
            ('Никитин', 'Иван', 'Олегович', '33C', NULL),
            ('Мироновская', 'Светлана', 'Вячеславовна', '33C', '89440001122'),
            ('Павлов', 'Дмитрий', 'Станиславович', '41A', '89551234567'),
            ('Рябцева', 'Виктория', 'Максимовна', '41A', NULL),
            ('Сидоров', 'Александр', 'Владимирович', '41A', '89662345678'),
            ('Тимофеева', 'Наталья', 'Игоревна', '42B', '89773456789'),
            ('Уваров', 'Егор', 'Дмитриевич', '42B', NULL);
    """)

    # обновляем клона
    op.execute("""
        UPDATE student
        SET  second_name = 'Назаров', name = 'Кирилл', patronymic = 'Дмитриевич', telephone = '89004989312'
        WHERE n_credit_book = 5;
    """)

    op.execute("COMMIT;")  # Завершаем предыдущие операции

    # добавляем новый предмет
    op.execute("""
        INSERT INTO discipline (n_discipline, title_discipline, second_name_teacher)
        VALUES (10, 'Математика', 'Петров')
        ON CONFLICT (n_discipline) DO NOTHING;
    """)

    op.execute("COMMIT;")  # Завершаем предыдущие операции

    # добавляем результаты экзаменов для уже имеющихся студентов с 5 по 13 и для новых с 14 по 30
    op.execute("""
    INSERT INTO student_discipline (n_credit_book, n_discipline, estimation)
    VALUES  (5, 10, 2), -- Назаров по математике (Петров) (не сдал)
            (5, 2, 4), -- Назаров по физике
            (5, 3, 2), -- Назаров по английскому (не сдал)
            (6, 4, 5), -- Кузнецов по химии
            (6, 6, 2), -- Кузнецов по литературе (не сдал)
            (6, 7, 4), -- Кузнецов по истории
            (7, 1, 2), -- Смирнов по математике (не сдал)
            (7, 2, 5), -- Смирнов по физике
            (7, 4, 4), -- Смирнов по химии
            (8, 3, 2), -- Васильев по английскому (не сдал)
            (8, 5, 5), -- Васильев по биологии
            (8, 6, 4), -- Васильев по литературе
            (9, 10, 5), -- Морозов по математике (Петров)
            (9, 2, 4), -- Морозов по физике
            (9, 7, 3), -- Морозов по истории
            (10, 4, 4), -- Новиков по химии
            (10, 6, 3), -- Новиков по литературе
            (10, 7, 5), -- Новиков по истории
            (11, 1, 4), -- Попов по математике
            (11, 5, 3), -- Попов по биологии
            (11, 6, 5), -- Попов по литературе
            (12, 2, 3), -- Соколов по физике
            (12, 4, 5), -- Соколов по химии
            (12, 7, 4), -- Соколов по истории
            (12, 3, 4), -- Лебедев по английскому
            (12, 6, 5), -- Лебедев по литературе
            (12, 7, 4), -- Лебедев по истории
            (14, 1, 5), -- Борисов по математике
            (14, 2, 4), -- Борисов по физике
            (14, 3, 2), -- Борисов по английскому (не сдал)
            (15, 5, 5), -- Миронова по биологии
            (15, 6, 2), -- Миронова по литературе (не сдала)
            (15, 7, 5), -- Миронова по истории
            (16, 1, 3), -- Гаврилов по математике
            (16, 2, 4), -- Гаврилов по физике
            (16, 4, 4), -- Гаврилов по химии
            (17, 3, 2), -- Денисова по английскому (не сдала)
            (17, 5, 4), -- Денисова по биологии
            (17, 6, 5), -- Денисова по литературе
            (18, 4, 5), -- Жуков по химии
            (18, 6, 3), -- Жуков по литературе
            (18, 7, 5), -- Жуков по истории
            (19, 1, 4), -- Захарова по математике
            (19, 2, 5), -- Захарова по физике
            (19, 6, 4), -- Захарова по литературе
            (20, 3, 5), -- Игнатьев по английскому
            (20, 5, 4), -- Игнатьев по биологии
            (20, 7, 3), -- Игнатьев по истории
            (21, 4, 4), -- Миронов по химии
            (21, 6, 5), -- Миронов по литературе
            (21, 7, 2), -- Миронов по истории (не сдал)
            (22, 1, 5), -- Лазарев по математике
            (22, 2, 4), -- Лазарев по физике
            (22, 5, 4), -- Лазарев по биологии
            (23, 6, 5), -- Макарова по литературе
            (23, 7, 5), -- Макарова по истории
            (23, 8, 3), -- Макарова по географии
            (24, 10, 4), -- Никитин по математике (Петров)
            (24, 3, 5), -- Никитин по английскому
            (24, 6, 3), -- Никитин по литературе
            (25, 2, 4), -- Мироновская по физике
            (25, 5, 5), -- Мироновская по биологии
            (25, 7, 4), -- Мироновская по истории
            (26, 10, 5), -- Павлов по математике (Петров)
            (26, 2, 5), -- Павлов по физике
            (26, 6, 4), -- Павлов по литературе
            (27, 3, 5), -- Рябцева по английскому
            (27, 5, 3), -- Рябцева по биологии
            (27, 6, 4), -- Рябцева по литературе
            (28, 4, 5), -- Сидоров по химии
            (28, 7, 3), -- Сидоров по истории
            (28, 9, 2), -- Сидоров по литературе (не сдал)
            (29, 1, 4), -- Тимофеева по математике
            (29, 2, 5), -- Тимофеева по физике
            (29, 6, 5), -- Тимофеева по литературе
            (30, 3, 4), -- Уваров по английскому
            (30, 5, 4), -- Уваров по биологии
            (30, 7, 5) -- Уваров по истории
            
            ON CONFLICT (n_credit_book, n_discipline) DO NOTHING;
    """)

def downgrade() -> None:

    # откат всех изменений, если нужно

    op.execute("""
    UPDATE student
    SET  second_name = 'Федоров', name = 'Антон', patronymic = 'Викторович', telephone = '89009876543'
    WHERE n_credit_book = 5;
    """)

    op.execute("""
    DELETE FROM student_discipline
    WHERE n_credit_book > 4;
    """)

    op.execute("""
    DELETE FROM discipline
    WHERE n_discipline = 10;
    """)

    op.execute("""
    DELETE FROM student
    WHERE n_credit_book > 13;
    """)

